
var dialogues = {
    "gatekeeper": ["Greetings, wanderer.",
    "Before you lies the dungeon. It is rife with danger but filled with opportunity.",
    "Seven floors down lives the warden. He holds the key that will let you out of here, " +
    "but to reach him, you will need to find better equipment, as it gets dark and dangerous the further down you go.",
    "Good fortune to you, adventurer.",
    "Mind the fog!"
    ],

    "instructor": ["Hello there. You must be a newcomer.",
        "You have many adventures ahead of you, but you must know some things first.",
        "Combat will be unavoidable in the dungeon. I see you have a weapon already, and you'll need to be prepared to use it." +
        "With your shield, you'll be able to block enemy attacks, and over time regain some health.",
        "Be warned, however, your shield is heavy, and you won't always be able to raise it immediately in time to block an attack.",
        "You'll have some time to get the hang of it, as the shallow parts of the dungeon contain weaker creatures. However, it gets much more " +
        "dangerous further down, and you'll need to find better gear to face the enemy.",
        "You'll need to learn to manage your inventory, which can be toggled by pressing 'i'."
    ],

    "gatekeeper1": ["It's a bit darker down here, so you'll need to find better equipment as soon as possible.", "Mind the fog!"],
    "gatekeeper2": ["You'll see a mix of enemies down here, I'd recommend you prepare for the worst.", "Mind the fog!"],
    "gatekeeper3": ["We're nearly halfway to floor 7.", "Mind the fog!"],
    "gatekeeper4": ["It's getting dark down here, but you may want to start conserving torches as it will only get worse.", "Mind the fog!"],
    "gatekeeper5": ["Only three more floors remain. Make sure you have the best possible equipment before moving on, though.", "Mind the fog!"],
    "gatekeeper6": ["We're getting close, I can sense it.", "Mind the fog!"],
    "gatekeeper7": ["The warden's floor. Let us end this.", "Mind the fog!"]
}
